insert into musicians(nickname)
values
('Король и шут'),
('Anna Asti'),
('Сектор Газа'),
('Ленинград'),
('Мот'),
('Niletto');


insert into genres(name)
values
('рок'),
('панк'),
('поп'),
('рэп');


insert into Albums(name, release) 
values
('Камнем по голове', 1996),
('Жаль, нет ружья', 2002),
('Тень клоуна', 2008),
('Феникс', 2022),
('Кащей Бессмертный', 1994),
('Сектор газа', 1997),
('Восставший из ада', 2000),
('Дачники', 2000),
('Хлеб', 2005),
('Бабье лето', 2006),
('Azbuka Morze', 2014),
('Парабола', 2020),
('Простым', 2020);


insert into tracks(name, duration, album_id)
values
('Сельчак и ветер', 183, 1),
('Праздник скоморох', 112, 1),
('Верная жена', 157, 1),
('Садовник', 222, 1),
('Блуждают тени', 131, 1),
('Внезапная голова', 144, 1),
('Шар голубой', 74, 1),
('Волосокрад', 267, 2),
('Мертвый анархист', 247, 2),
('Смешной совет', 245, 2),
('Некромант', 163, 2),
('Защитник свиней', 165, 2),
('Генрих и смерть', 144, 2),
('Жаль, нет ружья!', 220, 2),
('Полутень клоуна', 33, 3),
('Тень 1 - Тень клоуна', 137, 3),
('Тень 2 - Дагон', 303, 3),
('Тень 3 - Двое против всех', 233, 3),
('Тень 4 - В Париж - домой', 295, 3),
('Тень 5 - Ричард Гордон', 213, 3),
('Skit', 19, 4),
('Моя птичка', 115, 4),
('Затмила', 171, 4),
('Повело', 173, 4),
('По барам', 238, 4),
('Интродукция', 212, 5),
('Ария Ивана', 453, 5),
('Ария Ивана и Лягушки', 464, 5),
('Сектор газа', 219, 6),
('Ангел секса', 191, 6),
('Авто-мат', 197, 6),
('Я мочился в ночь', 131, 6),
('Эстрадная песня', 117, 6),
('Демобилизация', 235, 7),
('my Свадьба', 265, 7),
('Рога my', 195, 7),
('Сельский туалет', 169, 7),
('Грязная кровь', 245, 7),
('Дачники', 130, 8),
('СКА', 106, 8),
('Когда Net денег', 178, 8),
('Руки из карманов', 93, 8),
('Колбаса-любовь', 78, 8),
('Небесный Теннис', 208, 9),
('На не', 139, 9),
('Суть', 147, 9),
('my', 129, 9),
('Нефть', 102, 9),
('По my бабам', 147, 10),
('Любовь', 153, 10),
('Карлсон', 138, 10),
('Дача', 183, 10),
('Губошлеп', 168, 10),
('Эдем', 247, 11),
('Бенджамин', 256, 11),
('Барон Мюнхгаузен', 269, 11),
('Женщина', 198, 11),
('24-7', 258, 11),
('Парабола', 200, 12),
('На юга', 184, 12),
('Космос - это синяки', 196, 12),
('Дай джазу!', 212, 12),
('Люди', 237, 12),
('Я стану простым', 244, 13),
('Повезет', 224, 13),
('Сирень', 173, 13),
('Время отпусти меня', 156, 13),
('Платить за дружбу не нужно', 186, 13),
('Я останусь простым', 192, 13);


insert into genre_musician(genre_id, musician_id) 
values
(1, 1),
(1, 4),
(2, 3),
(3, 2),
(3, 4),
(3, 5),
(3, 6),
(4, 5),
(4, 6);


insert into album_musician(album_id, musician_id) 
values
(1, 1),
(2, 1),
(3, 1),
(4, 2),
(5, 3),
(6, 3),
(7, 3),
(8, 4),
(9, 4),
(10, 4),
(11, 5),
(12, 5),
(13, 6);


insert into collections(name, release) 
values
('Сборник_1', 2005),
('Сборник_2', 2013),
('Сборник_3', 2018),
('Сборник_4', 2023);


insert into track_collection(track_id, collection_id) 
values
(3, 1),
(14, 1),
(28, 1),
(41, 1),
(46, 1),
(14, 2),
(36, 2),
(40, 2),
(51, 2),
(54, 2),
(15, 3),
(19, 3),
(56, 3),
(59, 3),
(60, 3),
(58, 4),
(61, 4),
(64, 4),
(66, 4),
(67, 4);
